import matplotlib.pyplot as plt
import numpy as np

# 示例数据
x = np.arange(1, 31)  # 横轴：进化代数，范围是1到30
y_1 = np.array([6.134842e+09, 5.524842e+09, 4.388293e+09, 2.309192e+09, 1.847148e+09,
              1.812183e+09, 1.696166e+09, 1.510937e+09, 1.121420e+09, 1.002810e+09,
              9.257401e+08, 8.086052e+08, 6.752473e+08, 5.855340e+08, 5.24842e+08,
             5.145933e+08,5.063497e+08, 4.74842e+08,  4.24842e+08,   3.74842e+08, 
             3.574388e+08, 3.566608e+08, 3.24842e+08, 3.189254e+08,  3.189254e+08,
              3.189254e+08, 3.189254e+08, 3.189254e+08, 3.189254e+08,3.189254e+08,])  # 本文工作
y_2= [
    7.158925e+09,
    4.019332e+09,
    3.112564e+09,
    3.112564e+09,
    3.112564e+09,
    3.096897e+09,
    3.081231e+09,
    2.971565e+09,
    2.846232e+09,
    2.592479e+09,
    2.056727e+09,
    1.570873e+09,
    1.571064e+09,
    1.571064e+09,
    1.571001e+09,
    1.564886e+09,
    1.561798e+09,
    1.555620e+09,
    1.542215e+09,
    1.531134e+09,
    1.478992e+09,
    1.331409e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09,
    1.268375e+09
]                                                                                    # 常规初始化 + 高低敏感度进化
y_3 = [
    7.158925e+09,
    5.846509e+09,
    5.545357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09,
    4.375357e+09
]                                                                         #常规ES
# 创建折线图
plt.figure(figsize=(6, 6))
plt.plot(x, y_1, marker='.', linestyle='-', color='g', label='This work')
plt.plot(x, y_2, marker='.', linestyle='-', color='b', label='Naive ES + HLenvolve')
plt.plot(x, y_3, marker='.', linestyle='-', color='c', label='Naive ES')
plt.title('Population Average EDP Conv3')
plt.xlabel('Evolution Generation')
plt.ylabel('Population Average EDP (cycles * pJ)')

# 设置横轴刻度标签
plt.xticks([0, 10, 20, 30], fontsize=10, rotation=0)

# 添加图例
plt.legend()

# 保存图像
plt.savefig('conv3_population_average_EDP.png', dpi=300, bbox_inches='tight')  # 保存为PNG文件

# 如果不需要显示图像，可以注释掉这行
# plt.show()

